#Использовать logos

&Деталька(Значение = "oscript.server", ЗначениеПоУмолчанию = "https://oscript.io")
Перем АдресСайтаОСкрипт;

&Деталька(Значение = "build.server", ЗначениеПоУмолчанию = "https://build.oscript.io")
Перем АдресСервераСборок;

&Деталька(Значение = "build.job", ЗначениеПоУмолчанию = "1Script")
Перем ЗаданиеСервераСборок;

&Пластилин("ДетекторОкружения")
Перем Окружение;

&Дуб
Процедура ПриСозданииОбъекта()
КонецПроцедуры

// Путь к каталогу установки версий OneScript по умолчанию
//
//  Возвращаемое значение:
//   Строка - Путь к каталогу установки по умолчанию
//
&Завязь(Тип = "Строка")
Функция КаталогУстановкиПоУмолчанию() Экспорт

	КаталогУстановкиПоУмолчанию = ПолучитьПеременнуюСреды("OVM_INSTALL_PATH");
	Если НЕ ЗначениеЗаполнено(КаталогУстановкиПоУмолчанию) Тогда
		КаталогУстановкиПоУмолчанию = ОбъединитьПути(
			Окружение.ПутьКЛокальнымДаннымПриложений(),
			"ovm"
		);
	КонецЕсли;

	Возврат КаталогУстановкиПоУмолчанию;

КонецФункции

// Адрес сайта OneScript
//
//  Возвращаемое значение:
//   Строка - Адрес сайта OneScript
//
&Завязь(Тип = "Строка")
Функция АдресСайтаОСкрипт() Экспорт
	Возврат АдресСайтаОСкрипт;
КонецФункции

// Адрес сервера сборок OneScript (build.oscript.io)
//
//  Возвращаемое значение:
//   Строка - Адрес сервера сборок
//
&Завязь(Тип = "Строка")
Функция АдресСервераСборок() Экспорт
	Возврат АдресСервераСборок;
КонецФункции

// Имя многоветочного задания сборки OneScript на сервере сборок
//
//  Возвращаемое значение:
//   Строка - Имя задания сборки
//
&Завязь(Тип = "Строка")
Функция ЗаданиеСервераСборок() Экспорт
	Возврат ЗаданиеСервераСборок;
КонецФункции

// Полный адрес к каталогу дистрибутивов OneScript
//
//  Возвращаемое значение:
//   Строка - Полный адрес к каталогу дистрибутивов OneScript
//
&Завязь(Тип = "Строка")
Функция ПолныйАдресККаталогуДистрибутивов() Экспорт
	Возврат АдресСайтаОСкрипт() + "/downloads";
КонецФункции
